app/controllers/citas_controller.rb

SELECT * FROM "citas" WHERE ("citas"."fecha_hora" BETWEEN '2009-02-01 00:00:00' AND '2009-02-28 23:59:59')
---
  def index
    @mes_actual = Time.now
    @mes_anterior = 1.month.ago(@mes_actual)
    @mes_sig = 1.month.since(@mes_actual)
    @citas = Cita.find_all_by_fecha_hora(@mes_actual.beginning_of_month...@mes_actual.end_of_month)

SELECT * FROM "citas" WHERE ("citas"."fecha_hora" BETWEEN '2009-01-01 00:00:00' AND '2009-01-31 23:59:59')
---
  def update_calendario
    @mes_actual = Time.parse(params[:id])
    @mes_anterior = 1.month.ago(@mes_actual)
    @mes_sig = 1.month.since(@mes_actual)
    @citas = Cita.find_all_by_fecha_hora(@mes_actual.beginning_of_month...@mes_actual.end_of_month)

SELECT * FROM "citas" WHERE ("citas"."id" = 91)
---
  def confirma
    @cita = Cita.find(params[:id])