app/controllers/consultas_controller.rb

  def show
    @consulta = Consulta.find(params[:id])
---
SELECT * FROM "consultas" WHERE ("consultas"."id" = 68)

  def destroy
    @consulta = Consulta.find(params[:id])
    paciente_id=@consulta.paciente_id
    @consulta.destroy
---
SELECT * FROM "consultas" WHERE ("consultas"."id" = 112)
DELETE FROM "consultas" WHERE "id" = 112