app/controllers/doctors_controller.rb

SELECT * FROM "doctors" WHERE ("doctors"."id" = 26)
---
  def show
    @doctor = Doctor.find(params[:id])

SELECT * FROM "doctors" WHERE ("doctors"."id" = 26)
---
  def edit
    @doctor = Doctor.find(params[:id])

SELECT * FROM "doctors" WHERE ("doctors"."id" = 26)
UPDATE "doctors" SET "updated_at" = '2009-03-01 15:54:02', "especialidad_id" = 45 WHERE "id" = 26
---
  def update
    @doctor = Doctor.find(params[:id])
    respond_to do |format|
      if @doctor.update_attributes(params[:doctor])