app/controllers/estudios_controller.rb

  def edit
    @estudio = Estudio.find(params[:id])
---
SELECT * FROM "estudios" WHERE ("estudios"."id" = 2)