app/controllers/inters_controller.rb

SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 36)
SELECT * FROM "consultas" WHERE ("consultas"."id" = 48)
SELECT * FROM "operations" WHERE ("operations"."cita_id" = 85) LIMIT 1
---
  def imprime
    prawnto :prawn => {
                   :left_margin => 60,
                   :right_margin => 20,
                   :top_margin => 80,
                   :bottom_margin => 20 }
     @paciente = Paciente.find(params[:paciente_id])
     @consulta = Consulta.find(params[:id])
     @inter = @consulta.inter unless @consulta.inter.nil?
     @estudio = Operation.find_by_cita_id(@consulta.cita.id).ref_estudio

SELECT * FROM "consultas" LIMIT 20 OFFSET 0
SELECT count(*) AS count_all FROM "consultas"
---
  def index
    @consultas = Consulta.paginate(:all,:page => params[:page],:per_page => 20 )

SELECT * FROM "inters" WHERE ("inters"."id" = 1)
---
  def show
    @inter = Inter.find(params[:id])

SELECT * FROM "consultas" WHERE ("consultas"."id" = 48)
---
  def new
    @consulta = Consulta.find(params[:id])

SELECT * FROM "inters" WHERE ("inters"."id" = 3)
---
  def edit
    @inter = Inter.find(params[:id])

INSERT INTO "inters" ("updated_at", "conclusion", "activaciones", "consulta_id", "principal", "created_at") VALUES('2009-03-17 05:19:07', 'Estudio electroencefalográfico con colocación de electródos según la Técnica 10-20 internacional, calibración de 7 milímetros y 50 microvoltios.
---
  def create
    @inter = Inter.new(params[:inter])

    respond_to do |format|
      if @inter.save

SELECT * FROM "inters" WHERE ("inters"."id" = 5)
UPDATE "inters" SET "principal" = 'Estudio electroencefalográfico con colocación de electródos según la Técnica 10-20 internacional, calibración de 7 milímetros y 50 microvoltios.
---
  def update
    @inter = Inter.find(params[:id])

    respond_to do |format|
      if @inter.update_attributes(params[:inter])