app/controllers/lab_controller.rb

  def index
    #if @cons = Consulta.find_all_by_doctor_id(nil)
    #  for doc in @cons
    #    doc.destroy
    #  end
    #end

  #  if params[:search] != nil
  #    values={}
  #    nombre = "%#{params[:search]}%".split(/\s+/)
  #    nombre.each { |x| values[:str] = x}
  #    paciente = Paciente.find(:all,
  #     :conditions => ['nombre LIKE :str or app_pat LIKE :str or app_mat LIKE :str',values ])
  #    @consultas = Consulta.find_all_by_paciente_id(paciente.each { |x| x.id})
  #  else
  #    @consultas = Consulta.find(:all)
  #  end
  #  respond_to do |format|
  #    format.html # index.html.erb

    #end
    @citas = Cita.find(:all)
    @dates = @citas.collect { |p| p.fecha_hora.strftime('%d-%m-%Y') }
---
SELECT * FROM "citas" WHERE (status = 'Activa') AND ("citas"."fecha_hora" BETWEEN '2009-02-27 00:00:00' AND '2009-02-28 23:59:59')

  def show_horario
    @cubiculos = Horario.find_cubiculos
---
SELECT * FROM "horarios" ORDER BY cubiculo

  def envia_info
  consulta = Consulta.find(params[:id])
  @doctor = consulta.doctor
  @paciente = consulta.paciente
  @estudio = Estudio.find(consulta.estudio_id)
---
SELECT * FROM "consultas" WHERE ("consultas"."id" = 114)
SELECT * FROM "estudios" WHERE ("estudios"."id" = 1)
SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 60)