app/controllers/operations_controller.rb

  def index
    @operations = Operation.find(:all,:order => "indice_estudio ASC")
---
SELECT * FROM "estudios" WHERE ("estudios"."id" = 1)

  def show
    @operation = Operation.find(params[:id])
---
SELECT * FROM "operations" WHERE ("operations"."id" = 0)

  def edit
    @operation = Operation.find(params[:id])
---
SELECT * FROM "operations" WHERE ("operations"."id" = 88)

  def update
    @operation = Operation.find(params[:id])
    cita = Cita.find(@operation.cita_id)
    respond_to do |format|
      if @operation.update_attributes(params[:operation])
---
SELECT * FROM "operations" WHERE ("operations"."id" = 88)
UPDATE "operations" SET "indice_estudio" = 12, "updated_at" = '2009-03-17 07:51:38', "ref_estudio" = '10101' WHERE "id" = 88

  def edita
    @operation = Operation.find(params[:id])
---
SELECT * FROM "operations" WHERE ("operations"."id" = 88)