app/controllers/pacientes_controller.rb

SELECT * FROM "pacientes" WHERE (nombre LIKE '%%' or app_pat LIKE '%%' or app_mat LIKE '%%') LIMIT 10 OFFSET 0
SELECT count(*) AS count_all FROM "pacientes" WHERE (nombre LIKE '%%' or app_pat LIKE '%%' or app_mat LIKE '%%')
SELECT * FROM "consultas" WHERE ("consultas"."fecha_consulta" BETWEEN '2009-02-26 00:00:00' AND '2009-02-26 23:59:59')
---
  def index
    @usuario=current_usuario
    if params[:search] and @usuario.has_role?('admin') or @usuario.has_role?("socio") or @usuario.has_role?("gerente") or @usuario.has_role?("interprete")
      values={}
      nombre = "%#{params[:search]}%".split(/\s+/)
      nombre.each { |x| values[:str] = x}
      @pacientes = Paciente.paginate(:all,
      :conditions => ['nombre LIKE :str or app_pat LIKE :str or app_mat LIKE :str',values], :page => params[:page],:per_page => 10)

    elsif params[:search] and @usuario.has_role?('doctor') and doctor = @usuario.doctor
      values={}
      nombre = "%#{params[:search]}%".split(/\s+/)
      nombre.each { |x| values[:str] = x}
      @pacientes = doctor.pacientes.paginate(:all,
      :conditions => ['nombre LIKE :str or app_pat LIKE :str or app_mat LIKE :str',values], :page => params[:page],:per_page => 5)
    elsif doctor = @usuario.doctor and @usuario.has_role?('doctor')
      @pacientes = doctor.pacientes.paginate(:all,:page => params[:page],:per_page => 5)
    elsif @usuario.has_role?('admin') or @usuario.has_role?("socio") or @usuario.has_role?("gerente")
      consultas = Consulta.find_all_by_fecha_consulta(Time.now.beginning_of_day...1.day.since(Time.now))

SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 37)
SELECT * FROM "consultas" WHERE ("consultas"."id" = 49)
---
  def imprime_ficha
     prawnto :prawn => {
                    :left_margin => 20,
                    :right_margin => 20,
                    :top_margin => 400,
                    :bottom_margin => 20 }
    @paciente = Paciente.find(params[:id])
    @razon = ""
    @razon = @paciente.razon unless @paciente.razon.nil?
    @rfc = ""
    @rfc = @paciente.rfc unless @paciente.rfc.nil?
    @consulta = Consulta.find(params[:consulta_id])

SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 60)
---
  def show
    @paciente = Paciente.find(params[:id])

SELECT * FROM "estudios" WHERE ("estudios"."id" = 1)
---
  def new
    @paciente = Paciente.new
    @consulta = @paciente.consultas.build
    @consulta.estudio_id = Estudio.find(1)

SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 60)
SELECT * FROM "consultas" WHERE ("consultas"."paciente_id" = 60) LIMIT 1
---
  def edit
    @paciente = Paciente.find(params[:id])
    @fecha_nac = @paciente.fecha_nac.strftime('%d-%m-%Y')
    @consulta = Consulta.find_by_paciente_id(@paciente.id)

SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 60)
UPDATE "pacientes" SET "fecha_nac" = NULL, "updated_at" = '2009-02-26 18:22:04', "correo" = 'anahi@hotmail.com' WHERE "id" = 60
---
  def update
    @paciente = Paciente.find(params[:id])
    @paciente.attributes= params[:paciente]
    @paciente.fecha_nac=params[:fecha_nac] unless params[:fecha_nac].nil?
    respond_to do |format|

      if @paciente.save