app/controllers/pagos_controller.rb

SELECT * FROM "pagos" WHERE ("pagos"."id" = 47)
SELECT * FROM "pacientes" WHERE ("pacientes"."id" = 55)
SELECT * FROM "operations" WHERE ("operations"."id" = 87)
SELECT * FROM "estudios" WHERE ("estudios"."id" = 1)
---
  def imprime

      prawnto :prawn => {
                    :left_margin => 30,
                    :right_margin => 20,
                    :top_margin => 89,
                    :bottom_margin => 36 }


      @pago = Pago.find(params[:id])
      @paciente=Paciente.find(params[:paciente_id])
      if @paciente.rfc != nil
        @rfc = @paciente.rfc
      else
        @rfc=""
      end
      @operation = Operation.find(params[:operation_id])
      @estudio = Estudio.find(@operation.tipo_id)