app/controllers/referencias_controller.rb

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 12) LIMIT 1
---
  def index
    usuario = usuario=Usuario.find_by_id(session[:usuario_id])