app/controllers/reportes_controller.rb

SELECT count(*) AS count_all, strftime('%Y-%m',fecha_hora) AS strftime_y_m_fecha_hora FROM "citas" WHERE (status='Pagada') GROUP BY strftime('%Y-%m',fecha_hora) ORDER BY fecha_hora ASC
---
  def grafica

    g = Gruff::Bar.new('600x210') #Define a New Graph
    g.font = File.expand_path("/artwork/Vera.ttf", RAILS_ROOT)
    g.title = "Estudios por mes" #Title for the Graph
    g.theme = {
       :colors => ['#ff6600', '#3bb000', '#1e90ff', '#efba00', 'grey','red'],
       :marker_color => '#aaa',
       :background_colors => ['#eaeaea', '#fff']
     }
    #estudio = Cita.count(:all,:conditions => "status='Pagada'", :group => "DATE_FORMAT(fecha_hora,'%Y-%m')", :order =>"fecha_hora ASC")

    agrupar = RAILS_ENV=="production" ? "DATE_FORMAT(fecha_hora,'%Y-%m')": "strftime('%Y-%m',fecha_hora)"

    estudios = Cita.count(:all, :group => agrupar, :order =>"fecha_hora ASC")

SELECT count(*) AS count_all, tipo_id AS tipo_id FROM "operations" GROUP BY tipo_id ORDER BY tipo_id ASC
SELECT * FROM "estudios" WHERE ("estudios"."id" = 1)
---
  def grafica_2
      g = Gruff::Bar.new('580x210') #Define a New Graph
      g.font = File.expand_path("/artwork/Vera.ttf", RAILS_ROOT)
      g.title = "Tipos de Estudio" #Title for the Graph
      g.theme = {
         :colors => ['#ff6600', '#3bb000', '#1e90ff', '#efba00', '#0aaafd'],
         :marker_color => '#aaa',
         :background_colors => ['#eaeaea', '#fff']
       }
      operaciones = Operation.count(:all, :group => 'tipo_id',:order => "tipo_id ASC")
      tipos = operaciones.keys.sort
      claves = Hash[*tipos.collect {|v| [tipos.index(v),Estudio.find(v).tipo_estudio]}.flatten]