app/controllers/usuarios_controller.rb

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 12) LIMIT 1
---
  def index
    @usuarios = Usuario.find(:all, :order => :nombre )

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 12) LIMIT 1
---
  def show
    @usuario = Usuario.find(params[:id])

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 12) LIMIT 1
---
  def edit
    @usuario = Usuario.find(params[:id_usuario])

INSERT INTO "usuarios" ("name", "salt", "updated_at", "imagen", "crypted_password", "idioma", "remember_token_expires_at", "doctor_id", "remember_token", "login", "created_at", "email") VALUES('Ray Richard AwMiller', '18f00f5ed91b2696d9eac560d91846c0f51e89d1', '2009-03-01 17:56:09', NULL, '48f9c2a032324a40c34e23c378e9683bbaa4c4c5', NULL, NULL, NULL, NULL, 'ray', '2009-03-01 17:56:09', 'ray@hortmail.com')
SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 12) LIMIT 1
---
  def create
    @usuario = Usuario.new(params[:usuario])

    respond_to do |format|
      if @usuario.save
        @password = params[:usuario][:password]
        @doctor = Doctor.find(params[:usuario][:doctor_id])

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 12) LIMIT 1
UPDATE "usuarios" SET "imagen" = 'Photo_19.jpg', "crypted_password" = 'dac4f0f26be0572c24958485814b24da322da96f', "updated_at" = '2009-03-01 16:51:55' WHERE "id" = 24
---
  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])